Repository: hexC0D3/Grades
Catalog: core/lang/*/LC_MESSAGES/grades.po
Languages: de_de

source: The hex color format isn't correct!
de_de: Das HEX-Farbformat ist nicht korrekt!

source: Profile Settings
de_de: Profileinstellungen

source: Username
de_de: Benutzername

source: Some cool nice colors can be found
de_de: Gute Farben finden sie

source: here
de_de: hier

source: Color One (Hexcode, like #000 for black)
de_de: Farbe 1 (HEX-Format)

source: Color Two (Hexcode, like #f00 for red)
de_de: Farbe 2 (HEX-Format)

source: Update Profile
de_de: Profil aktualisiereren

source: The config file already exists! Please delete this file! You can also delete the config file to redo the setup.
de_de: Die Konfigurationsdatei existiert schon. Bitte löschen Sie diese Datei! Sie können auch die Konfigurationsdatei löschen, um den Setup-Vorgang zu wiederholen.

source: Please check your database data
de_de: Bitte überprüfen Sie Ihre Datenbankangaben

source: The 2 entered passwords don't match!
de_de: Die Passwörter stimmen nicht überein!

source: Database Name
de_de: Datenbankname

source: Database Username
de_de: Datenbank-Benutzername

source: Database Password
de_de: Datenbank-Passwort

source: Database Host, 'localhost' in most cases
de_de: Datenbank-Host (meist 'localhost')

source: Admin Username
de_de: Administrator-Benutzername

source: Admin Password
de_de: Administrator-Passwort

source: Confirm Admin Password
de_de: Administrator-Passwort bestätigen

source: ERROR WHILE UPDATING
de_de: FEHLER BEI DER AKTUALISIERUNG

source: Update
de_de: Aktualisierung

source: Update Grades
de_de: Gardes Aktualisieren

source: Grades: password reset
de_de: Grades: Passwort zurücksetzen

source: The reset of your password was requested! If you didn't request it, ignore this mail. If you want to reset your password click
de_de: Lieber Grades-BenutzerSie haben ein neues Passwort angefordert. Wenn Sie das nicht gemacht haben, ignorieren Sie dieses e-Mail. Um Ihr Passwort zurückzusetzen klicken Sie

source: Hi
de_de: Hallo

source: Click
de_de: Klicken Sie

source: to verify your Grades account.
de_de: um ihren Grades-Account zu verifizieren.

source: Grades: registration
de_de: Grades: Registrierung

source: Error while sending mail! Please report this to me@tyratox.ch
de_de: e-Mail konnte nicht versendet werden. Bitte melden Sie sich bei me@tyratox.ch

source: Grades: new class admin
de_de: Grades: Neuer Klassen-Administrator

source: is your new class admin.
de_de: ist jetzt ihr neuer Klassen-Administrator.

source: Your Grades Team
de_de: Ihr Grades-Team

source: Grades: new school admin
de_de: Grades: Schul-Administrator

source: is your new school admin.
de_de: ist jetzt ihr neuer Schul-Administrator.

source: The entered password don't match!
de_de: Das eingegebene Passwort ist nicht korrekt!

source: You have to enter a new password!
de_de: Sie müssen ein neues Passwort eingeben.

source: Password Reset
de_de: Passwort zurücksetzen

source: New Password
de_de: Neues Passwort

source: Confirm New Password
de_de: Neues Passwort bestätigen

source: Please re-send the mail, we weren't able to verify, that this is your account!
de_de: Bitte fordern Sie einen neue Bestätigungs e-Mail an. Wir konnten nicht identifizieren, ob dies Ihr Account ist.

source: Something went wrong! If you believe this is an error please report this to me@tyratox.ch
de_de: Ups, etwas ist falsch gelaufen! Wenn Sie glauben, dass dies ein Fehler ist, melden Sie sich bei me@tyratox.ch

source: Average Mark
de_de: Durchschnittsnote

source: Welcome to Grades
de_de: Willkommen bei Grades

source: You can now start with joining a school and a class. After that you can start adding grades.
de_de: Sie können nun beginnen, indem Sie einer Klasse beitreten und Ihre Fächer wählen. Dann können Sie ihre Noten eintragen!

source: You don't have the permission to do this!
de_de: Sie haben keine Berechtigung, dies zu tun!

source: You aren't able to join this class!
de_de: Sie können dieser Klasse nicht beitreten!

source: You have already joined a class!
de_de: Sie sind dieser Klasse bereits beigetreten!

source: You are not able to leave this class, because you're the admin of it!
de_de: Sie können diese Klasse nicht verlassen, da sie der Klassen-Administrator sind!

source: This class doesn't exist!
de_de: Diese Klasse existiert nicht!

source: You are already admin of a class!
de_de: Sie sind bereits Admin einer Klasse!

source: This class already exists!
de_de: Diese Klasse existiert bereits!

source: First you have to join a school!
de_de: Sie müssen zuerst einer Schule beitreten!

source: First you have to join a class!
de_de: Sie müssen zuerst einer Klasse beitreten!

source: Mail Subject
de_de: Betreff

source: Send Mail
de_de: e-Mail senden

source: Class Name
de_de: Klassenname

source: Class Admin
de_de: Klassen-Administrator

source: Actions
de_de: Aktionen

source: Join
de_de: Beitreten

source: If you leave this class all test and the related grades will be lost for you! Do you want to continue?
de_de: Wenn Sie diese Klasse verlassen, werden alle darin eingetragenen Noten entfernt! Möchten Sie diese Klasse wirklich verlassen?

source: Leave
de_de: Verlassen

source: Edit
de_de: Bearbeiten

source: Are you sure, that you want to delete your class? This will delete all tests of this class and also the corresponding grades!
de_de: Wenn Sie diese Klasse löschen, werden alle darin eingetragenen Noten entfernt! Möchten Sie diese Klasse wirklich löschen?

source: Delete
de_de: Löschen

source: First you've to join a school!
de_de: Sie müssen zuerst einer Schule beitreten!

source: Create a new class
de_de: Neue Klasse erstellen

source: You aren't allowed to see this page!
de_de: Sie haben keinen Zugriff auf diese Seite.

source: Update class
de_de: Klasse aktualisieren

source: Action has successfully been completed!
de_de: Aktion erfolgreich abgeschlossen!

source: Yes
de_de: Ja

source: Cancel
de_de: Abbrechen

source: This isn't your mark!
de_de: Dies ist nicht ihre Note!

source: You have already entered your mark for this test!
de_de: Sie haben bereits eine Note für diesen Test eingetragen!

source: Invalid Test!
de_de: Ungültiger Test!

source: Please fill in all required fields!
de_de: Bitte füllen Sie alle benötigten Felder aus!

source: Add a mark
de_de: Note hinzufügen

source: Your Mark (between 1 and 6)
de_de: Ihre Note (zwischen 1 und 6)

source: Corresponding Test
de_de: dazugehöriger Test

source: Add mark
de_de: Note hinzufügen

source: Update mark
de_de: Aktualisierung

source: Grades
de_de: Noten

source: Grade List
de_de: Notenliste

source: Add Mark
de_de: Note hinzufügen

source: Test List
de_de: Testliste

source: Create a test
de_de: Test hinzufügen

source: Subjects
de_de: Fächer

source: Subject List
de_de: Fächerliste

source: Create Subject
de_de: Fach hinzufügen

source: My Class
de_de: Meine Klasse

source: Go to classroom
de_de: Zum Klassenzimmer

source: Class List
de_de: Klassenliste

source: Create a class
de_de: Klasse hinzufügen

source: Schools
de_de: Schulen

source: School List
de_de: Schulliste

source: Create a school
de_de: Schule hinzufügen

source: Profile
de_de: Profil

source: Settings
de_de: Einstellungen

source: Logout
de_de: Ausloggen

source: This school doesn't exist!
de_de: Diese Schule existiert nicht!

source: Your school already exists!
de_de: Diese Schule existiert bereits!

source: You have already joined a school!
de_de: Sie sind bereits einer Schule beigetreten!

source: You can't leave this school, because you're the admin of it!
de_de: Sie können diese Schule nicht verlassen, da sie der Schul-Administrator sind!

source: School Name
de_de: Schulname

source: Do you really want to leave this school? This will wipe all of your data!
de_de: Möchten Sie diese Schule wirklich verlassen? Dies löscht alle ihre Daten!

source: Do you really want to delete this school? This will wipe all of your data!
de_de: Möchten Sie diese Schule wirklich löschen? Dies löscht alle ihre Daten!

source: School Website URL (without http://)
de_de: Schulwebsite (ohne http://)

source: Update school
de_de: Schule aktualisieren

source: You have already joined this subject!
de_de: Sie haben dieses Fach bereits gewählt.

source: You aren't able to join this subject!
de_de: Sie können dieses Fach nicht wählen.

source: Yet you haven't joined this subject!
de_de: Sie haben dieses Fach noch nicht gewählt.

source: Subject Name
de_de: Name des Faches

source: shouldn't be empty!
de_de: Sollte nicht leer sein.

source: Is subject relevant?
de_de: Ist dieses Fach Promotionsrelevant?

source: This subject already exists!
de_de: Dieser Fach existiert bereits!

source: Topic
de_de: Thema

source: Description
de_de: Beschreibung

source: Type
de_de: Testart

source: Test Date
de_de: Datum

source: Mark
de_de: Note

source: Choose a subject on the main page by clicking on its name.
de_de: Wählen Sie ein Fach auf der Hauptseite, indem Sie auf dessen Namen klicken.

source: Relevant ?
de_de: Promotionsrelevant

source: No
de_de: nein

source: Are you sure, that you want to leave this subject? This will delete all grades related to this subject!
de_de: Möchten Sie dieses Fach wirklich abwählen? Dies löscht alle Noten, die Sie in diesem Fach eingetragen haben!

source: Are you sure, that you want to delete this subject? This will delete all grades related to this subject!
de_de: Möchten Sie dieses Fach wirklich löschen? Dies löscht alle Noten, die in diesem Fach eingetragen wurden!

source: You aren't allowed to create a subject!
de_de: Sie sind nicht dazu berechtigt, ein Fach zu erstellen! Kontaktieren Sie ihren Klassen-Administrator.

source: Create a new subject
de_de: Neues Fach erstellen

source: You aren't allowed to edit this subject!
de_de: Sie sind nicht dazu berechtigt, dieses Fach zu bearbeiten! Kontaktieren Sie ihren Klassen-Administrator.

source: Edit the subject
de_de: Fach bearbeiten

source: Update subject
de_de: Fach aktualisieren

source: Something went wrong, please contact me@tyratox.ch
de_de: Ups, etwas ist falsch gelaufen! Melden Sie sich bei me@tyratox.ch

source: Subject
de_de: Betreff

source: Date
de_de: Datum

source: Are you sure, that you want to delete this test? This will delete all grades related to this test!
de_de: Möchten Sie diesen Test wirklich löschen? Dies löscht alle Noten, die für diesen Test eingetragen wurden!

source: Please check first if this test already exists!
de_de: Bitte überprüfen Sie, ob dieser Test bereits existiert!

source: Test Topic
de_de: Thema

source: Test Type(written, oral, ..)
de_de: Testart

source: Short Test Description
de_de: Beschreibung

source: Test Subject
de_de: Fach

source: Test Date (dd. mm. yyyy)
de_de: Datum

source: Update test
de_de: Test aktualisieren

source: User not found!
de_de: Benutzer wurde nicht gefunden!

source: Check your mail account.
de_de: Bitte überprüfen Sie ihre e-Mail Adresse!

source: Your mail or your username is already in use!
de_de: Diese/r Benutzername oder e-Mail ist bereits in Verwendung!

source: The entered passwords aren't equal!
de_de: Die eingegebenen Passwörter stimmen nicht überein!

source: Please fill in all fields!
de_de: Bitte füllen Sie alle Felder aus!

source: Please check your login!
de_de: Bitte überprüfen Sie ihren Benutzernamen!

source: Welcome
de_de: Willkommen

source: to
de_de: bei

source: Register
de_de: Registrieren

source: Reset your Password
de_de: Passwort zurücksetzen

source: About this Website
de_de: Über diese Website

source: Our Team
de_de: Unser Team

source: Password
de_de: Passwort

source: Verify Password
de_de: Passwort verifizieren

source: Reset Password
de_de: Passwort zurücksetzen

source: Username or E-Mail
de_de: Benutzername oder e-Mail Adresse

source: Reset your password
de_de: Passwort zurücksetzen
